In [2]:
import pandas as pd
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [3]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [4]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [6]:
pd.merge(employees, departments, on="DeptID") #inner join - default join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [7]:
pd.merge(employees, departments, on="DeptID", how="left") #left join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [8]:
pd.merge(employees, departments, on="DeptID", how="right") #right join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [9]:
pd.merge(employees, departments, on="DeptID", how="outer") #outer join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [13]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"],"score":[423,459] })
df2 = pd.DataFrame({"Name": ["Charlie", "David"],"age": [20,40]})

      Name  score   age
0    Alice  423.0   NaN
1      Bob  459.0   NaN
0  Charlie    NaN  20.0
1    David    NaN  40.0

In [14]:
df1

    Name  score
0  Alice    423
1    Bob    459

In [15]:
df2

      Name  age
0  Charlie   20
1    David   40

In [16]:
pd.concat([df1, df2]) #Vertical (rows)

      Name  score   age
0    Alice  423.0   NaN
1      Bob  459.0   NaN
0  Charlie    NaN  20.0
1    David    NaN  40.0

In [17]:
pd.concat([df1, df2], axis=1)#Horizontal (columns)

    Name  score     Name  age
0  Alice    423  Charlie   20
1    Bob    459    David   40